Revit 2027 API
ParameterUtils.GetAllBuiltInGroups Method
 Gets the identifiers of all built-in parameter groups.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ForgeTypeId> GetAllBuiltInGroups()
Public Shared Function GetAllBuiltInGroups As IList(Of ForgeTypeId)
public:
static IList<ForgeTypeId^>^ GetAllBuiltInGroups()
static member GetAllBuiltInGroups : unit -> IList<ForgeTypeId>
Return Value
IList<ForgeTypeId>
 The built-in group identifiers.
See Also
Reference
ParameterUtils Class
Autodesk.Revit.DB Namespace